Revit 2027 API
BuiltInFailures.DimensionFailures.SpotSlopeReferenceIsVertical Property
 The highlighted Spot Slope references an element that is vertical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpotSlopeReferenceIsVertical { get; }
Public Shared ReadOnly Property SpotSlopeReferenceIsVertical As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpotSlopeReferenceIsVertical {
	FailureDefinitionId^ get ();
}
static member SpotSlopeReferenceIsVertical : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace